openFoam/heatTransfer/chtMultiRegionFoam/infinitelyFastFlame/0/flame/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5.x                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0/flame";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [ 0 1 -1 0 0 0 0 ];

internalField   uniform ( 0 0 0 );

boundaryField
{
    maxY
    {
        type            fixedValue;
        value           uniform ( 0 0 0 );
    }
    maxX
    {
        type            inletOutlet;
        value           uniform ( 0 0 0 );
        inletValue      uniform ( 0 0 0 );
    }
    minY
    {
        type            fixedValue;
        value           uniform ( 0 0 0 );
    }
    minZ
    {
        type            fixedValue;
        value           uniform ( 0 0 0 );
    }
    maxZ
    {
        type            fixedValue;
        value           uniform ( 0 0 0 );
    }
    flame_to_solid
    {
        type            fixedValue;
        value           uniform ( 0 0 0 );
    }
    minX
    {
        type            fixedValue;
        value           uniform ( 0 0 0 );
    }
}


// ************************************************************************* //
