openFoam/heatTransfer/chtMultiRegionFoam/infinitelyFastFlame/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5.x                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    maxY
    {
        type            empty;
        inGroups        1(empty);
        nFaces          100;
        startFace       99;
    }
    minX
    {
        type            patch;
        nFaces          1;
        startFace       199;
    }
    maxX
    {
        type            patch;
        nFaces          1;
        startFace       200;
    }
    minY
    {
        type            empty;
        inGroups        1(empty);
        nFaces          100;
        startFace       201;
    }
    minZ
    {
        type            empty;
        inGroups        1(empty);
        nFaces          100;
        startFace       301;
    }
    maxZ
    {
        type            empty;
        inGroups        1(empty);
        nFaces          100;
        startFace       401;
    }
)

// ************************************************************************* //
