openFoam/heatTransfer/chtMultiRegionFoam/infinitelyFastFlame/constant/solid/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5.x                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     0.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/solid/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


6
(
    maxY
    {
        type            empty;
        inGroups        1 ( empty );
        nFaces          50;
        startFace       49;
    }

    minX
    {
        type            patch;
        nFaces          1;
        startFace       99;
    }

    minY
    {
        type            empty;
        inGroups        1 ( empty );
        nFaces          50;
        startFace       100;
    }

    minZ
    {
        type            patch;
        inGroups        1 ( empty );
        nFaces          50;
        startFace       150;
    }

    maxZ
    {
        type            patch;
        inGroups        1 ( empty );
        nFaces          50;
        startFace       200;
    }

    solid_to_flame
    {
        type            mappedWall;
        inGroups        1 ( wall );
        nFaces          1;
        startFace       250;
        sampleMode      nearestPatchFace;
        sampleRegion    flame;
        samplePatch     flame_to_solid;
    }

)


// ************************************************************************* //
