openFoam/heatTransfer/chtMultiRegionFoam/infinitelyFastFlame/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     chtMultiRegionFoam;

startFrom       latestTime;

startTime       0;

stopAt          endTime;

endTime         1000;

deltaT          0.001;

writeControl    adjustableRunTime;

writeInterval   100;

purgeWrite      0;

writeFormat     ascii;

writePrecision  8;

writeCompression off;

timeFormat      general;

timePrecision   8;

runTimeModifiable yes;

maxCo           0.6;

// Maximum diffusion number
maxDi           10.0;

adjustTimeStep  yes;

functions
{
	probes1
	{
		type				probes;
		functionObjectLibs	("libsampling.so");
		writeControl		writeTime;
		writeInterval		1;
		region				solid;
		probeLocations
		(
			(-0.25  0.0 0.0)
		);
		fields
		(
			T	
		);
	}
	probes2
	{
		type				probes;
		functionObjectLibs	("libsampling.so");
		writeControl		writeTime;
		writeInterval		1;
		region				flame;
		probeLocations
		(
			(0.25 0.0 0.0)
		);
		fields
		(
			T	
		);
	}
}

// ************************************************************************* //
