openFoam/heatTransfer/chtMultiRegionFoam/infinitelyFastFlame/system/topoSetDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      topoSetDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

actions
(
    // solid
    {
        name    solidCellSet;
        type    cellSet;
        action  new;
        source  boxToCell;
        sourceInfo
        {
            box (-100 -100 -100)(0.0 100 100);
        }
    }
    {
        name    solid;
        type    cellZoneSet;
        action  new;
        source  setToCellZone;
        sourceInfo
        {
            set solidCellSet;
        }
    }

    // flame is all the other cells
    {
        name    flameCellSet;
        type    cellSet;
        action  new;
        source  cellToCell;
        sourceInfo
        {
            set solidCellSet;
        }
    }
    {
        name    flameCellSet;
        type    cellSet;
        action  invert;
    }
    {
        name    flame;
        type    cellZoneSet;
        action  new;
        source  setToCellZone;
        sourceInfo
        {
            set flameCellSet;
        }
    }
);


// ************************************************************************* //
